yamaxgucci/esp32-os/components/argon_port/idf/src/io_hw.c
/*
 * ArgonOS port: ESP-IDF - pins and buses.
 *
 * Registers and nothing else.  Who owns a pin, where a bus gets its pins from,
 * and what happens to both when a process dies are all in src/dev/io.c, which
 * is the same code on every port.
 *
 * Copyright (c) 2026 ArgonOS contributors.  SPDX-License-Identifier: GPL-3.0-or-later
 */
#include <argon/port/io.h>

#include <string.h>

#include "driver/gpio.h"
#include "freertos/FreeRTOS.h"
#include "freertos/semphr.h"
#include "driver/i2c_master.h"
#include "driver/ledc.h"
#include "driver/spi_master.h"
#include "esp_log.h"
#include "esp_memory_utils.h"

/*
 * The copy buffer for callers whose memory the DMA engine cannot read.
 *
 * A kilobyte each way, and deliberately not the same as
 * AG_PORT_SPI_MAX_XFER: making them equal meant that raising the transfer
 * limit - which is what a display wants - also raised the fixed cost of every
 * bus that comes up, on a board where eight kilobytes is real money.
 */
#define AG_PORT_SPI_BOUNCE 1024
#include "hal/gpio_types.h"

#if AG_PORT_HAS_ADC
#include "esp_adc/adc_oneshot.h"
#endif

#include <argon/port/mem.h>

#define AG_PORT_I2C_BUSES SOC_I2C_NUM
/* Indexed by the chip's own bus number, which is what the caller passes. */
#define AG_PORT_SPI_SLOTS (SOC_SPI_PERIPH_NUM + 1)
#define AG_PORT_SPI_HOST_OF(chip) ((chip) - 1)

/*
 * Every ESP-IDF failure becomes one of ours, because an application cannot do
 * anything with an esp_err_t and the ABI promises it will never see one.
 */
static ag_err_t from_esp(esp_err_t err)
{
    switch (err) {
    case ESP_OK:                 return AG_OK;
    case ESP_ERR_INVALID_ARG:    return -AG_EINVAL;
    case ESP_ERR_INVALID_STATE:  return -AG_EBUSY;
    case ESP_ERR_NO_MEM:         return -AG_ENOMEM;
    case ESP_ERR_TIMEOUT:        return -AG_ETIMEDOUT;
    case ESP_ERR_NOT_FOUND:      return -AG_ENODEV;
    case ESP_ERR_NOT_SUPPORTED:  return -AG_ENOTSUP;
    default:                     return -AG_EIO;
    }
}

/* ---------------------------------------------------------------------- */
/* What the machine itself is using                                       */
/* ---------------------------------------------------------------------- */

unsigned ag_port_reserved_pins(const ag_port_pin_range_t **out)
{
    static const ag_port_pin_range_t k_ranges[] = {
#if CONFIG_IDF_TARGET_ESP32S3
        /* SPI0/1 to the flash chip: 26 SPICS1, 27 SPIHD, 28 SPIWP, 29 SPICS0,
         * 30 SPICLK, 31 SPIQ, 32 SPID. */
        {26, 32, "flash"},
#if CONFIG_SPIRAM_MODE_OCT
        /* Octal PSRAM takes four more data lines and its own chip select. */
        {33, 37, "psram"},
#endif
#elif CONFIG_IDF_TARGET_ESP32
        /*
         * SPI0/1 to the flash chip: 6 SPICLK, 7 SPIQ, 8 SPID, 9 SPIHD,
         * 10 SPIWP, 11 SPICS0.  On a WROOM module these are inside the can and
         * a single output configured on one of them stops the chip fetching
         * instructions - the failure looks like a board that died halfway
         * through printing a line, with nothing in the log to say why.
         *
         * Boards using the same module with octal PSRAM take 16 and 17 as well;
         * this project has no such board, so nothing here pretends to know.
         */
        {6, 11, "flash"},
#elif CONFIG_IDF_TARGET_ESP32C6
        /*
         * SPI0/1 to the flash chip: 24 SPICS0, 25 SPIQ, 26 SPIWP, 27 VDD_SPI,
         * 28 SPIHD, 29 SPICLK, 30 SPID (soc/spi_pins.h).  27 is not a signal
         * at all - it is the regulator output the flash is powered from - and
         * it is inside the range on purpose: driving it is the same dead board
         * as driving the clock.
         */
        {24, 30, "flash"},
        /*
         * The USB pins, and on this board they are the console: there is no
         * bridge chip, the Type-C socket goes to the part itself, and taking
         * either of these pins ends the conversation with no way to say so.
         * Named here rather than left to the console's own two lines because
         * they are the machine's whatever the console is set to.
         */
        {12, 13, "usb"},
#else
        {0, -1, NULL}, /* nothing known for this target */
#endif
    };

    *out = k_ranges;
    return (unsigned)(sizeof(k_ranges) / sizeof(k_ranges[0]));
}

/* ---------------------------------------------------------------------- */
/* GPIO                                                                   */
/* ---------------------------------------------------------------------- */

static bool s_isr_service;

ag_err_t ag_port_gpio_config(int pin, int mode)
{
    gpio_config_t cfg = {
        .pin_bit_mask = 1ULL << (unsigned)pin,
        .intr_type = GPIO_INTR_DISABLE,
    };

    switch (mode) {
    case AG_GPIO_IN:
        cfg.mode = GPIO_MODE_INPUT;
        break;
    /*
     * Outputs keep their input buffer on, so that reading a pin tells you what
     * is on the line.  For a push-pull output that is a free confirmation of
     * what was written; for an open-drain one it is the whole point, because
     * the line is only low when nobody is holding it up - which is how I2C and
     * 1-Wire are read at all.
     */
    case AG_GPIO_OUT:
        cfg.mode = GPIO_MODE_INPUT_OUTPUT;
        break;
    case AG_GPIO_OUT_OD:
        cfg.mode = GPIO_MODE_INPUT_OUTPUT_OD;
        break;
    case AG_GPIO_IN_PULLUP:
        cfg.mode = GPIO_MODE_INPUT;
        cfg.pull_up_en = GPIO_PULLUP_ENABLE;
        break;
    case AG_GPIO_IN_PULLDOWN:
        cfg.mode = GPIO_MODE_INPUT;
        cfg.pull_down_en = GPIO_PULLDOWN_ENABLE;
        break;
    default:
        return -AG_EINVAL;
    }

    return from_esp(gpio_config(&cfg));
}

void ag_port_gpio_write(int pin, int level)
{
    (void)gpio_set_level((gpio_num_t)pin, (level != 0) ? 1 : 0);
}

int ag_port_gpio_read(int pin) { return gpio_get_level((gpio_num_t)pin); }

ag_err_t ag_port_gpio_isr_attach(int pin, int edge, ag_isr_fn fn, void *arg)
{
    if (!s_isr_service) {
        const esp_err_t installed = gpio_install_isr_service(0);
        if (installed != ESP_OK && installed != ESP_ERR_INVALID_STATE) {
            return from_esp(installed);
        }
        s_isr_service = true;
    }

    gpio_int_type_t type = GPIO_INTR_ANYEDGE;
    if (edge == AG_EDGE_RISING) {
        type = GPIO_INTR_POSEDGE;
    } else if (edge == AG_EDGE_FALLING) {
        type = GPIO_INTR_NEGEDGE;
    }

    ag_err_t err = from_esp(gpio_set_intr_type((gpio_num_t)pin, type));
    if (err == AG_OK) {
        err = from_esp(gpio_isr_handler_add((gpio_num_t)pin, fn, arg));
    }
    return err;
}

void ag_port_gpio_isr_detach(int pin)
{
    (void)gpio_isr_handler_remove((gpio_num_t)pin);
    (void)gpio_set_intr_type((gpio_num_t)pin, GPIO_INTR_DISABLE);
}

void ag_port_gpio_reset(int pin) { (void)gpio_reset_pin((gpio_num_t)pin); }

/* ---------------------------------------------------------------------- */
/* I2C                                                                    */
/* ---------------------------------------------------------------------- */

