yamaxgucci/esp32-os/components/argon_port/idf/src/io_hw.c
typedef struct {
    i2c_master_bus_handle_t bus;
    i2c_master_dev_handle_t dev;
    uint32_t                khz;
    uint8_t                 dev_addr;
    bool                    up;
} i2c_state_t;

static i2c_state_t s_i2c[AG_PORT_I2C_BUSES];

ag_err_t ag_port_i2c_open(int bus, int sda, int scl, uint32_t khz, bool pullups)
{
    if (bus < 0 || bus >= AG_PORT_I2C_BUSES) {
        return -AG_ERANGE;
    }
    if (s_i2c[bus].up) {
        return AG_OK;
    }

    const i2c_master_bus_config_t cfg = {
        .i2c_port = bus,
        .sda_io_num = (gpio_num_t)sda,
        .scl_io_num = (gpio_num_t)scl,
        .clk_source = I2C_CLK_SRC_DEFAULT,
        .glitch_ignore_cnt = 7,
        .flags = {.enable_internal_pullup = pullups},
    };

    const ag_err_t err = from_esp(i2c_new_master_bus(&cfg, &s_i2c[bus].bus));
    if (err != AG_OK) {
        return err;
    }

    s_i2c[bus].khz = khz;
    s_i2c[bus].up = true;
    return AG_OK;
}

/*
 * One cached device handle per bus.  The ESP-IDF driver wants a handle per
 * address and this interface is per transaction, so something has to bridge the
 * two: a cache of one is enough because a driver talks to its own chip in a
 * run, and changing address costs one allocation rather than one per byte.
 */
static ag_err_t i2c_device(int bus, uint8_t addr, i2c_master_dev_handle_t *out)
{
    if (bus < 0 || bus >= AG_PORT_I2C_BUSES || !s_i2c[bus].up) {
        return -AG_ENODEV;
    }

    if (s_i2c[bus].dev != NULL && s_i2c[bus].dev_addr == addr) {
        *out = s_i2c[bus].dev;
        return AG_OK;
    }
    if (s_i2c[bus].dev != NULL) {
        (void)i2c_master_bus_rm_device(s_i2c[bus].dev);
        s_i2c[bus].dev = NULL;
    }

    const i2c_device_config_t cfg = {
        .dev_addr_length = I2C_ADDR_BIT_LEN_7,
        .device_address = addr,
        .scl_speed_hz = s_i2c[bus].khz * 1000u,
    };
    const ag_err_t err = from_esp(
        i2c_master_bus_add_device(s_i2c[bus].bus, &cfg, &s_i2c[bus].dev));
    if (err != AG_OK) {
        return err;
    }

    s_i2c[bus].dev_addr = addr;
    *out = s_i2c[bus].dev;
    return AG_OK;
}

ag_err_t ag_port_i2c_write(int bus, uint8_t addr, const void *buf, size_t len,
                           uint32_t timeout_ms)
{
    i2c_master_dev_handle_t dev = NULL;
    const ag_err_t          err = i2c_device(bus, addr, &dev);
    return (err != AG_OK)
               ? err
               : from_esp(i2c_master_transmit(dev, buf, len, (int)timeout_ms));
}

ag_err_t ag_port_i2c_read(int bus, uint8_t addr, void *buf, size_t len,
                          uint32_t timeout_ms)
{
    i2c_master_dev_handle_t dev = NULL;
    const ag_err_t          err = i2c_device(bus, addr, &dev);
    return (err != AG_OK)
               ? err
               : from_esp(i2c_master_receive(dev, buf, len, (int)timeout_ms));
}

ag_err_t ag_port_i2c_wrrd(int bus, uint8_t addr, const void *wbuf, size_t wlen,
                          void *rbuf, size_t rlen, uint32_t timeout_ms)
{
    i2c_master_dev_handle_t dev = NULL;
    const ag_err_t          err = i2c_device(bus, addr, &dev);
    return (err != AG_OK) ? err
                          : from_esp(i2c_master_transmit_receive(
                                dev, wbuf, wlen, rbuf, rlen, (int)timeout_ms));
}

ag_err_t ag_port_i2c_probe(int bus, uint8_t addr, uint32_t timeout_ms)
{
    if (bus < 0 || bus >= AG_PORT_I2C_BUSES || !s_i2c[bus].up) {
        return -AG_ENODEV;
    }

    /*
     * Silence the driver for the duration.  An address with nothing on it times
     * out, and the driver logs that as an error - which is right when a driver
     * is talking to a chip it expects to be there, and wrong a hundred and
     * twelve times over when the whole point is to find out which addresses are
     * empty.  A scan of an empty bus filled the screen with ESP-IDF error text
     * and buried its own result.
     */
    const esp_log_level_t was = esp_log_level_get("i2c.master");
    esp_log_level_set("i2c.master", ESP_LOG_NONE);

    const esp_err_t rc = i2c_master_probe(s_i2c[bus].bus, addr,
                                          (int)timeout_ms);

    esp_log_level_set("i2c.master", was);

    if (rc == ESP_OK) {
        return AG_OK;
    }
    /* "Nothing here" is not "the bus is broken", and must not read as one. */
    return (rc == ESP_ERR_NOT_FOUND || rc == ESP_ERR_TIMEOUT) ? -AG_ENOENT
                                                              : from_esp(rc);
}

/* ---------------------------------------------------------------------- */
/* SPI                                                                    */
/* ---------------------------------------------------------------------- */

/*
 * Several chips on one bus, each with its own speed.
 *
 * There used to be one device per bus, swapped whenever the chip select
 * changed.  That is fine while a bus has one chip on it and wrong the moment
 * it has two, which is the normal case: this board hangs a 320x240 panel and a
 * touch controller off the same three wires, and the panel wants 40 MHz while
 * the controller will not answer above about two.  One speed for the bus means
 * either a display that takes a second a frame or a touchscreen that returns
 * noise.
 */
#define AG_PORT_SPI_DEVS 4

typedef struct {
    spi_device_handle_t dev;
    int                 cs;
    uint32_t            khz;
} spi_dev_t;

typedef struct {
    spi_dev_t devs[AG_PORT_SPI_DEVS];
    uint32_t  khz; /* the bus default, for a chip nobody set a speed for */
    uint8_t  *bounce; /* tx half then rx half, internal and DMA-able      */
    /*
     * One transfer at a time on this bus, whoever asks.
     *
     * A bus is shared hardware and this port keeps shared state for it: one
     * bounce buffer, and a table of devices built on demand.  Two tasks reach
     * both.  On the CYD they do it constantly: an application pushes pixels
     * to the panel from its own thread while the console task reads the touch
     * controller, and the two sit on SPI2 with a chip select each.
     *
     * Unserialised, a touch reading and a panel command share the bounce
     * buffer, and the panel is handed the touch's bytes: a window command
     * that is not the one that was meant, and a band of pixels landing
     * somewhere else on the glass.  That is what the dots on Maxim's screen
     * were - random places, gone at the next repaint - and why they appeared
     * when touch went pixel-precise: four times the traffic, four times the
     * chances to collide.
     *
     * Recursive, because a transfer too big for the bounce buffer chops
     * itself into transfers that come back through the front door - and
     * because dropping chip select between the halves of one command is
     * exactly what must not happen.
     */
    SemaphoreHandle_t lock;
    bool      up;
} spi_state_t;

static spi_state_t s_spi[AG_PORT_SPI_SLOTS];

static bool spi_valid(int bus)
{
    return bus > 0 && bus < AG_PORT_SPI_SLOTS;
}

ag_err_t ag_port_spi_open(int bus, int sck, int mosi, int miso, uint32_t khz)
{
    if (!spi_valid(bus)) {
        return -AG_ERANGE;
    }
    if (s_spi[bus].up) {
        return AG_OK;
    }

    const spi_bus_config_t cfg = {
        .mosi_io_num = mosi,
        .miso_io_num = miso,
        .sclk_io_num = sck,
        .quadwp_io_num = -1,
        .quadhd_io_num = -1,
        .max_transfer_sz = AG_PORT_SPI_MAX_XFER,
    };

    const esp_err_t rc = spi_bus_initialize(AG_PORT_SPI_HOST_OF(bus), &cfg,
                                            SPI_DMA_CH_AUTO);
    /* Somebody else may already own it - the card on SPI, for one. */
    if (rc != ESP_OK && rc != ESP_ERR_INVALID_STATE) {
        return from_esp(rc);
    }

    s_spi[bus].lock = xSemaphoreCreateRecursiveMutex();
    if (s_spi[bus].lock == NULL) {
        (void)spi_bus_free(AG_PORT_SPI_HOST_OF(bus));
        return -AG_ENOMEM;
    }
    s_spi[bus].bounce = ag_port_alloc(2u * AG_PORT_SPI_BOUNCE, AG_MEM_DMA);
    if (s_spi[bus].bounce == NULL) {
        vSemaphoreDelete(s_spi[bus].lock);
        s_spi[bus].lock = NULL;
        (void)spi_bus_free(AG_PORT_SPI_HOST_OF(bus));
        return -AG_ENOMEM;
    }

    s_spi[bus].khz = khz;
    for (int i = 0; i < AG_PORT_SPI_DEVS; i++) {
        s_spi[bus].devs[i].cs = -1;
    }
    s_spi[bus].up = true;
    return AG_OK;
}

static ag_err_t spi_set_khz_locked(int bus, int cs, uint32_t khz);

ag_err_t ag_port_spi_set_khz(int bus, int cs, uint32_t khz)
{
    if (!spi_valid(bus)) {
        return -AG_ERANGE;
    }
    if (!s_spi[bus].up || s_spi[bus].lock == NULL) {
        return -AG_ENODEV;
    }
    /* The device table is the bus's, and this rebuilds entries in it while
     * another task may be half way through a transfer on one of them. */
    xSemaphoreTakeRecursive(s_spi[bus].lock, portMAX_DELAY);
    const ag_err_t err = spi_set_khz_locked(bus, cs, khz);
    xSemaphoreGiveRecursive(s_spi[bus].lock);
    return err;
}

static ag_err_t spi_set_khz_locked(int bus, int cs, uint32_t khz)
{
    for (int i = 0; i < AG_PORT_SPI_DEVS; i++) {
        spi_dev_t *d = &s_spi[bus].devs[i];
        if (d->cs != cs) {
            continue;
        }
        if (d->khz == khz) {
            return AG_OK;
        }
        /* Speed is fixed when a device is created, so change it by throwing
         * the device away; the next transfer builds one at the new speed. */
        if (d->dev != NULL) {
            (void)spi_bus_remove_device(d->dev);
        }
        d->dev = NULL;
        d->cs = -1;
        break;
    }

    for (int i = 0; i < AG_PORT_SPI_DEVS; i++) {
        spi_dev_t *d = &s_spi[bus].devs[i];
        if (d->cs < 0 && d->dev == NULL) {
            d->cs = cs;
            d->khz = khz;
            return AG_OK;
        }
    }
    return -AG_ENFILE;
}

static ag_err_t spi_device_for(int bus, int cs, spi_device_handle_t *out)
{
    if (!spi_valid(bus) || !s_spi[bus].up) {
        return -AG_ENODEV;
    }

    spi_dev_t *free_slot = NULL;
    for (int i = 0; i < AG_PORT_SPI_DEVS; i++) {
        spi_dev_t *d = &s_spi[bus].devs[i];
        if (d->cs == cs) {
            if (d->dev != NULL) {
                *out = d->dev;
                return AG_OK;
            }
            free_slot = d; /* speed was set for it, device not built yet */
            break;
        }
        if (free_slot == NULL && d->cs < 0 && d->dev == NULL) {
            free_slot = d;
        }
    }
    if (free_slot == NULL) {
        return -AG_ENFILE;
    }

