yamaxgucci/esp32-os/components/argon_port/idf/src/io_hw.c
    const uint32_t khz = (free_slot->khz != 0) ? free_slot->khz
                                               : s_spi[bus].khz;
    const spi_device_interface_config_t cfg = {
        .clock_speed_hz = (int)(khz * 1000u),
        .mode = 0,
        .spics_io_num = cs,
        .queue_size = 1,
    };

    const ag_err_t err = from_esp(
        spi_bus_add_device(AG_PORT_SPI_HOST_OF(bus), &cfg, &free_slot->dev));
    if (err != AG_OK) {
        return err;
    }

    free_slot->cs = cs;
    free_slot->khz = khz;
    *out = free_slot->dev;
    return AG_OK;
}

static ag_err_t spi_xfer_locked(int bus, int cs, const void *tx, void *rx,
                                size_t len);

ag_err_t ag_port_spi_xfer(int bus, int cs, const void *tx, void *rx, size_t len)
{
    if (len == 0 || len > AG_PORT_SPI_MAX_XFER) {
        return -AG_EINVAL;
    }
    if (!spi_valid(bus) || !s_spi[bus].up || s_spi[bus].lock == NULL) {
        return -AG_ENODEV;
    }

    /*
     * Waiting for the bus is not an error to report upwards: the other holder
     * is a device driver in the middle of a transfer, and it will finish.  A
     * timeout here would turn a busy bus into a driver failure.
     */
    xSemaphoreTakeRecursive(s_spi[bus].lock, portMAX_DELAY);
    const ag_err_t err = spi_xfer_locked(bus, cs, tx, rx, len);
    xSemaphoreGiveRecursive(s_spi[bus].lock);
    return err;
}

static ag_err_t spi_xfer_locked(int bus, int cs, const void *tx, void *rx,
                                size_t len)
{
    spi_device_handle_t dev = NULL;
    ag_err_t            err = spi_device_for(bus, cs, &dev);
    if (err != AG_OK) {
        return err;
    }

    /*
     * Straight from the caller's buffer when the DMA engine can read it.
     *
     * The bounce buffer exists for memory DMA cannot reach - PSRAM, or a stack
     * in some ports - and copying through it unconditionally was the simple
     * choice.  It also capped every transfer at the bounce size, which on the
     * display path meant three transfers where one would do, and a transfer
     * costs the same setup whatever it carries.
     *
     * A write-only transfer from DMA-capable memory needs neither the copy nor
     * the cap.  Anything else still goes through the bounce, in pieces.
     */
    if (rx == NULL && tx != NULL && esp_ptr_dma_capable(tx)) {
        spi_transaction_t direct = {
            .length = len * 8u,
            .tx_buffer = tx,
            .rx_buffer = NULL,
        };
        return from_esp(spi_device_polling_transmit(dev, &direct));
    }

    if (len > AG_PORT_SPI_BOUNCE) {
        /*
         * Has to be copied, so it goes a bounce-buffer at a time.  Only for a
         * write: chopping a transfer that also reads would drop chip select
         * between the halves, and a chip being read mid-command would not
         * survive that.
         */
        if (rx != NULL) {
            return -AG_EINVAL;
        }
        const uint8_t *p = (const uint8_t *)tx;
        size_t         left = len;
        while (left > 0) {
            const size_t n = (left > AG_PORT_SPI_BOUNCE) ? AG_PORT_SPI_BOUNCE
                                                         : left;
            const ag_err_t e = ag_port_spi_xfer(bus, cs, p, NULL, n);
            if (e != AG_OK) {
                return e;
            }
            p += n;
            left -= n;
        }
        return AG_OK;
    }

    uint8_t *const out = s_spi[bus].bounce;
    uint8_t *const in = out + AG_PORT_SPI_BOUNCE;

    if (tx != NULL) {
        memcpy(out, tx, len);
    } else {
        memset(out, 0, len);
    }

    spi_transaction_t t = {
        .length = len * 8u,
        .tx_buffer = out,
        .rx_buffer = (rx != NULL) ? in : NULL,
    };
    /*
     * Polled, not queued.
     *
     * spi_device_transmit hands the transfer to the driver's queue, waits on a
     * semaphore and is woken by the interrupt at the end.  That is the right
     * shape for a transfer long enough to be worth sleeping through, and the
     * wrong one for the traffic that actually goes over this bus: a panel being
     * fed a frame in kilobyte pieces.  Measured on the display path, the queued
     * version cost about two hundred and twenty microseconds of setup per
     * transfer against two hundred of clock - so half the time on the wire was
     * not on the wire at all.
     *
     * Polling spins for the duration instead, which is exactly what a caller
     * pushing pixels wants: it has nothing else to do until they are sent, and
     * the bus is held for less time overall.
     */
    err = from_esp(spi_device_polling_transmit(dev, &t));

    if (err == AG_OK && rx != NULL) {
        memcpy(rx, in, len);
    }
    return err;
}

/* ---------------------------------------------------------------------- */
/* PWM                                                                    */
/* ---------------------------------------------------------------------- */

ag_err_t ag_port_pwm_config(int channel, int pin, uint32_t hz, uint8_t bits)
{
    if (channel < 0 || channel >= AG_PORT_PWM_CHANNELS) {
        return -AG_ERANGE;
    }

    /*
     * One timer per channel, so that two pins can run at different rates.  The
     * chip has four; beyond that, channels share and the last frequency wins -
     * which is a limit worth knowing rather than hiding.
     */
    const ledc_timer_t        timer = (ledc_timer_t)(channel % LEDC_TIMER_MAX);
    const ledc_timer_config_t tcfg = {
        .speed_mode = LEDC_LOW_SPEED_MODE,
        .timer_num = timer,
        .duty_resolution = (ledc_timer_bit_t)bits,
        .freq_hz = hz,
        .clk_cfg = LEDC_AUTO_CLK,
    };

    ag_err_t err = from_esp(ledc_timer_config(&tcfg));
    if (err == AG_OK) {
        const ledc_channel_config_t ccfg = {
            .gpio_num = pin,
            .speed_mode = LEDC_LOW_SPEED_MODE,
            .channel = (ledc_channel_t)channel,
            .timer_sel = timer,
            .duty = 0,
            .hpoint = 0,
        };
        err = from_esp(ledc_channel_config(&ccfg));
    }
    return err;
}

ag_err_t ag_port_pwm_set(int channel, uint32_t duty)
{
    if (channel < 0 || channel >= AG_PORT_PWM_CHANNELS) {
        return -AG_ERANGE;
    }

    ag_err_t err = from_esp(
        ledc_set_duty(LEDC_LOW_SPEED_MODE, (ledc_channel_t)channel, duty));
    if (err == AG_OK) {
        err = from_esp(
            ledc_update_duty(LEDC_LOW_SPEED_MODE, (ledc_channel_t)channel));
    }
    return err;
}

