yamaxgucci/esp32-os/components/argon_port/idf/src/io_hw.c
void ag_port_pwm_stop(int channel)
{
    if (channel >= 0 && channel < AG_PORT_PWM_CHANNELS) {
        (void)ledc_stop(LEDC_LOW_SPEED_MODE, (ledc_channel_t)channel, 0);
    }
}

/* ---------------------------------------------------------------------- */
/* ADC                                                                    */
/* ---------------------------------------------------------------------- */

#if AG_PORT_HAS_ADC

static adc_oneshot_unit_handle_t s_adc1;
static bool                      s_adc_chan[AG_PORT_ADC_CHANNELS];

int32_t ag_port_adc_read(int channel)
{
    if (channel < 0 || channel >= AG_PORT_ADC_CHANNELS) {
        return -AG_ERANGE;
    }
    if (AG_PORT_ADC_GPIO(channel) < 0) {
        return -AG_ENOTSUP;
    }

    if (s_adc1 == NULL) {
        const adc_oneshot_unit_init_cfg_t init = {
            .unit_id = ADC_UNIT_1,
            .ulp_mode = ADC_ULP_MODE_DISABLE,
        };
        const ag_err_t err = from_esp(adc_oneshot_new_unit(&init, &s_adc1));
        if (err != AG_OK) {
            return err;
        }
    }

    if (!s_adc_chan[channel]) {
        const adc_oneshot_chan_cfg_t chan = {
            .bitwidth = ADC_BITWIDTH_DEFAULT,
            /* The widest range: measuring a 3.3 V rail at 0 dB reads full
             * scale and says nothing, which is the mistake everybody makes. */
            .atten = ADC_ATTEN_DB_12,
        };
        const ag_err_t err = from_esp(
            adc_oneshot_config_channel(s_adc1, (adc_channel_t)channel, &chan));
        if (err != AG_OK) {
            return err;
        }
        s_adc_chan[channel] = true;
    }

    int            raw = 0;
    const ag_err_t rc =
        from_esp(adc_oneshot_read(s_adc1, (adc_channel_t)channel, &raw));
    return (rc == AG_OK) ? (int32_t)raw : rc;
}

#else

int32_t ag_port_adc_read(int channel)
{
    (void)channel;
    return -AG_ENOTSUP;
}

#endif /* AG_PORT_HAS_ADC */
